[
    {
        "content": "Box office hit Dune, featuring Timothée Chalamet and Zendaya, made more than £20m when it came out in the UK in October.\n\nBBC.COM\nDune leads Bafta Film Awards nominations with 11",
        "comments_and_replies": [
            {
                "comment": "Dune is utterly brilliant and Chalamet absolutely nailed that role.",
                "commenter_name": "Ahmad AS",
                "replies": [
                    "Ahmad AS I haven't seen it, it's on my watchlist."
                ]
            },
            {
                "comment": "I would say Timothée Chalamet and Rebecca Ferguson. Zendaya has only a few minutes of screen time in this movie (part 1)",
                "commenter_name": "Nitij Ramdany",
                "replies": [
                    "Nitij Ramdany https://\nwww.facebook.com\n/\n1681438735465040\n/posts/\n3126506387624927\n/?app=fbl"
                ]
            },
            {
                "comment": "It was rubbish. The original had Sting and a guy milking a cat. There was no Sting *or* cat milking in this crappy remake. 2/5 👎",
                "commenter_name": "Steve McMahon",
                "replies": [
                    "Steve McMahon"
                ]
            },
            {
                "comment": "Should also win the award for most abrupt end to a film or (by the same token) best 1/3 of a film.",
                "commenter_name": "Chris Smith",
                "replies": [
                    "Chris Smith https://\nwww.facebook.com\n/\n1681438735465040\n/posts/\n3126506387624927\n/?app=fbl"
                ]
            },
            {
                "comment": "Bought the film on Monday,definite\nly the best version of the book, can't rate the film high enough.",
                "commenter_name": "Ken Thursfield",
                "replies": []
            },
            {
                "comment": "Zendaya was there like for 5 mins, why so much hype? Rebecca Ferguson was more pivotal in the film, she deserves more recognition",
                "commenter_name": "Ulises Cabrera",
                "replies": [
                    "Ulises Cabrera https://\nwww.facebook.com\n/\n1681438735465040\n/posts/\n3126506387624927\n/?app=fbl"
                ]
            },
            {
                "comment": "We need more!",
                "commenter_name": "Mark Withers",
                "replies": []
            },
            {
                "comment": "I thought it was crap 💩",
                "commenter_name": "David Gilmartin",
                "replies": [
                    "David Gilmartin https://\nwww.facebook.com\n/\n1681438735465040\n/posts/\n3126506387624927\n/?app=fbl",
                    "Thanks David 👍",
                    "Muslem Aasi no not clicking on it I am skint 😂😂"
                ]
            },
            {
                "comment": "It’s very good !",
                "commenter_name": "Jérémie Renoir",
                "replies": []
            },
            {
                "comment": "\"Box office hit\"?...",
                "commenter_name": "Radomir Ansel",
                "replies": []
            },
            {
                "comment": "Can't wait for the other part/s",
                "commenter_name": "Chris Kautz",
                "replies": []
            },
            {
                "comment": "Dune, the longest trailer ever",
                "commenter_name": "Fred Thom",
                "replies": []
            },
            {
                "comment": "Hmmmmmm",
                "commenter_name": "Otene Eche Peter",
                "replies": [
                    "Otene Eche Peter https://\nwww.facebook.com\n/\n1681438735465040\n/posts/\n3126506387624927\n/?app=fbl"
                ]
            },
            {
                "comment": "Watched it last night. Decent film I thought 🤔",
                "commenter_name": "Tim McArdle",
                "replies": []
            },
            {
                "comment": "Oh that’s great",
                "commenter_name": "Dakota Jekkins",
                "replies": []
            }
        ]
    },
    {
        "content": "Two men and a 17-year-old girl have been found guilty of murdering a doctor in a homophobic attack in a park in the centre of Cardiff.\n\nBBC.COM\nThree guilty of homophobic murder of doctor",
        "comments_and_replies": [
            {
                "comment": "Let us hope that the sentence justifies their actions Unbelievable that a 16 year old girl was involved.",
                "commenter_name": "Valerie Wheeler",
                "replies": [
                    "Valerie Wheeler 17 year old girl .",
                    "Valerie Wheeler it's not unbelievable in this country the way things are going sadly",
                    "Not that unbelievable if you've ever encountered chavs",
                    "Valerie Wheeler don’t forget to half it for good behaviour!",
                    "Paul Evans Okay okay",
                    "Jonas Biwi Dionne Timms-Williams,\nfrom Creigiau, was 16 at the time."
                ]
            },
            {
                "comment": "Isn’t stamping on anyone’s head a hate crime? Sentence should be life no matter the victim, they should never be able to walk free again, the victim can’t. Just listen to what they said while beating someone to death 🤬🤬🤬",
                "commenter_name": "Barry Ings",
                "replies": []
            },
            {
                "comment": "They should receive whole of life jail sentences. Anything less is a joke. We are far too soft in this country on serious crimes.",
                "commenter_name": "Gill Robinson",
                "replies": [
                    "Gill Robinson well said . Unless it’s whole life then the joke of a life sentence will be halved for good behaviour!"
                ]
            },
            {
                "comment": "Throw the bloody key away!!! So Gould never be released into the community again after what they did to this poor man.",
                "commenter_name": "Helen Todhunter",
                "replies": []
            },
            {
                "comment": "One of them 17 ! Enjoy the rest of your youth and early middle years in prison. Bet you don't think it was a good idea now.\nR.I.P",
                "commenter_name": "Rob Wilson",
                "replies": [
                    "Rob Wilson Not sure how it works in UK,if she can be convicted as an adult?",
                    "Jonas Kalén I think so Jonas, but i may be wrong there.",
                    "Jonas Kalén the judge did great in letting her be named,thought she was big enough to the crime then let her do the time..hope they kick the 💩 out of her.",
                    "Rob Wilson I read that they can, children as young as 10 can be tried as adults for the most serious crimes.\nThey can’t get life but many many years.",
                    "Rob Wilson they’ll be out in 6 months",
                    "Tim Hills I certainly hope its considerably longer than that.",
                    "Carolyn Bury Sadly in Sweden only from 18 years old you can get adult prison. So the gangs use the younger to shoot and kill rivals.They don’t mind to be in youth care for 2 years.",
                    "Jonas Kalén its a crazy horrible sad world we live in..."
                ]
            },
            {
                "comment": "Heartbreaking, such evil beings to get enjoyment out of killing a fellow human. Sentences need to be much much longer. Thoughts go out too the gentleman’s family and friends.",
                "commenter_name": "Angela L Cooper",
                "replies": []
            },
            {
                "comment": "Ppl just can’t stay in their lane, they have to be consumed with others personal life, ideals & beliefs. The sentence better fit their gruesome act.",
                "commenter_name": "Bo Stultz",
                "replies": []
            },
            {
                "comment": "Life for life.\n\nThey knowingly inflicted terrible injuries on an innocent man, the proof is undeniable.\n\nDeath penalty is needed for cases like this where it is beyond all reasonable doubt.\n\nImagine what that poor man went through during this attack and then try and justify why any of them should still be alive after this verdict.\nTo call them animals is insulting to any member of the animal kingdom.\n\nThey have no place in our society and an example should be made of them, sadly it won't be a terminal example.",
                "commenter_name": "Tony Holmes",
                "replies": []
            },
            {
                "comment": ",The prosecution barrister (!!),rather than defence one,homophobica\nlly and inexcusably shamed the innocent victim.\nThat barrister should be dropped by his chambers who themselves should step up and condemn his opening comments in court.The CPS should not engage him ever again.",
                "commenter_name": "Hywel Ebsworth",
                "replies": [
                    "Hywel Ebsworth Not sure how it works over there but prosecutors should be fired for that opening statement. Horrible"
                ]
            },
            {
                "comment": "Doctors are saving lives and these are murderers killing, must get sevior punishment",
                "commenter_name": "Gladys Rodrigues",
                "replies": []
            },
            {
                "comment": "Good, shocking what happened to that poor man 😢",
                "commenter_name": "Kathleen Craig",
                "replies": [
                    "Kathleen Craig I think you meant to say God"
                ]
            },
            {
                "comment": "Absolutely awful that this is still happening in this day and age, and such a young person one of those responsible, as a society we need to do better, and you have people laughing at this 🤮",
                "commenter_name": "Rian Mac Cathmhaoil",
                "replies": []
            },
            {
                "comment": "My thoughts are with his family and friends RIP",
                "commenter_name": "Lynne Greenfield",
                "replies": []
            },
            {
                "comment": "I’m guessing the writers of some of these comments have read other articles\nAs this one uses ‘homophobic’ in the heading but no other mention of anything g regarding that\nIn any case it doesn’t matter\nTaking a life in any way is despicable and they need to be put away for the rest of their miserable Iives",
                "commenter_name": "Mandy McLaughlan",
                "replies": []
            },
            {
                "comment": "What happened to the poor man😢\nIt's a pity the teenage girl will spend the rest of her life in jail",
                "commenter_name": "Love & Relationship quotes",
                "replies": [
                    "Love & Relationship quotes, what?",
                    "Love & Relationship quotes not a pity at all!",
                    "Love & Relationship quotes what pity should she get? She helped end a life",
                    "Ges Gilbert",
                    "Love & Relationship quotes it's no pity at all. What is a pity is an innocent man's life being taken by these animals.",
                    "I can sense the IQ from here",
                    "Love & Relationship quotes\nWhy is it a pity? I don't believe in capital punishment, but in many countries that's exactly what she'd be looking at. In fact in some she would've already been executed, think on that with your pity."
                ]
            },
            {
                "comment": "All that learning to become a doctor all what it cost and all that potential means nothing to these ignorant cretans xxx",
                "commenter_name": "Maria Lee",
                "replies": [
                    "Maria Lee ...and all the lives that now WON'T be saved!"
                ]
            },
            {
                "comment": "Omg!! Just why??? Life should mean life, despicable individuals!",
                "commenter_name": "Shelley Yeaman",
                "replies": []
            },
            {
                "comment": "I have to wander how police etc came to the conclusion this man was cruising. Gay man in a park should Not equate to that conclusion",
                "commenter_name": "Matt McCoy",
                "replies": [
                    "It was in the wee hours"
                ]
            },
            {
                "comment": "Be a miracle if each of them get a sentence that actually fits the crime, bet they’re all back on the street in a few yrs 😡",
                "commenter_name": "Lorraine N Winn",
                "replies": []
            },
            {
                "comment": "A true life sentence, meaning every second of every day for te rest of their lives in prison .",
                "commenter_name": "Jeanette Brown",
                "replies": []
            },
            {
                "comment": "how awful for him. poor man, what is this, Afghanistan!?",
                "commenter_name": "Howard Andrew Digby",
                "replies": [
                    "Howard Andrew Digby wow comparing this to Afghan 🤦‍♂️",
                    "Howard Andrew Digby no, it's Cardiff, it says that in the post.",
                    "We’re they pa*is that did this? 😮",
                    "Shaz Romanov\nJudging from your spelling I guess you don't have the mental capacity to read the first paragraph that contains the names!",
                    "Hocine Dridi the coward has a fake profile.",
                    "Shaz Romanov you should have been wiped on your mum's curtains."
                ]
            },
            {
                "comment": "Not human , just rabid animals - should be locked in a cage for life, typically the one person laughing at this is a right wing trump supporter ! Says it all",
                "commenter_name": "Carl Woodhouse",
                "replies": []
            },
            {
                "comment": "I hope they all three get their due.",
                "commenter_name": "Miriam Cicinitski",
                "replies": []
            },
            {
                "comment": "Hope they get there comeuppance in prison and more",
                "commenter_name": "Jean Grocott",
                "replies": []
            },
            {
                "comment": "RIP, Hope it was not also part of racism.",
                "commenter_name": "T Boy T Boy",
                "replies": [
                    "T Boy T Boy racism?"
                ]
            },
            {
                "comment": "Danger to society, lock them away for good.",
                "commenter_name": "Sue Jenkins",
                "replies": []
            },
            {
                "comment": "What a truly horrible country this is becoming 😢",
                "commenter_name": "Ken Thursfield",
                "replies": [
                    "Ken Thursfield for real. Its sad that we must share this world with such cruel people",
                    "Ken Thursfield been like it for decades😞",
                    "Scott Taylor unfortunately I agree but it seems to be getting worse",
                    "Ken Thursfield it's already horrible 30 years ago, we cannot see it, blaming on foreigners, not anymore coz it's the British doings 😬 this is why I voted Tories and brexit to see all this 👍🏾",
                    "Ken Thursfield feeling the same way about Canada. You aren't alone. Humans are moving backwards in all ways it seems.",
                    "Mchull Teka nonsense. Much different society 30 years ago and no one said anything about \"foreigners\" except you.",
                    "JV Patterson society is the same as 30 years, the only difference was no mobiles and everything else is taboo and you probably likes it just move over to Australia/new Zealand 👍🏾",
                    "Scott Taylor everything getting worse 😪",
                    "Ken Thursfield everything getting worse",
                    "Social media showing us it’s worldwide, and making it worse in many cases. Lots of places in world horrible, always have been."
                ]
            },
            {
                "comment": "Good lock them up for the rest of there lives",
                "commenter_name": "Thompson Carruthers",
                "replies": []
            },
            {
                "comment": "Hyenas. Hope they enjoy being part of the prison pack. Not.",
                "commenter_name": "Felicity Zeb",
                "replies": []
            },
            {
                "comment": "If you bring back the rope then that chap could still be alive you know it make sense.",
                "commenter_name": "Royce Williams",
                "replies": []
            },
            {
                "comment": "Just shows cruising in parks is still dangerous.",
                "commenter_name": "David Mawson",
                "replies": []
            },
            {
                "comment": "The world has gone crazy.",
                "commenter_name": "Kathy Bridges",
                "replies": []
            },
            {
                "comment": "Hope they enjoy their next 30 yrs",
                "commenter_name": "Kevin Jardine",
                "replies": []
            },
            {
                "comment": "Good they were found guilty. Now for a just sentence.",
                "commenter_name": "Teddy Wood",
                "replies": []
            },
            {
                "comment": "Why does the headline say ‘homophobic’?",
                "commenter_name": "Rose Welch",
                "replies": []
            },
            {
                "comment": "Lock them up and throw the key away",
                "commenter_name": "Andrew Smith",
                "replies": [
                    "Andrew Smith agreed"
                ]
            },
            {
                "comment": "For God's sake 17 years old. 😒😔",
                "commenter_name": "Luiekano Pembele",
                "replies": []
            },
            {
                "comment": "Hope the sentences will be harsh. Life.",
                "commenter_name": "Sue Cox",
                "replies": []
            },
            {
                "comment": "rope",
                "commenter_name": "Carl Stewart",
                "replies": []
            },
            {
                "comment": "Lock them up and throw away the key..should be life for a life,Rest in peace Gary..",
                "commenter_name": "Carolyn Bury",
                "replies": []
            },
            {
                "comment": "Utterly heartbreaking.",
                "commenter_name": "Jackie John",
                "replies": []
            },
            {
                "comment": "Disgusting. Should be prevented from ever receiving medical attention again in the future.",
                "commenter_name": "Elocin Snave",
                "replies": []
            },
            {
                "comment": "The only problem caused by long prison sentences is the cost to the tax payer .",
                "commenter_name": "Joan Williamson",
                "replies": []
            },
            {
                "comment": "It's moment like these that make me question my stance on capital punishment. Please sentence them to the maximum for Dr. Jenkins.",
                "commenter_name": "Owen Huynh",
                "replies": []
            },
            {
                "comment": "Humanity at its worst.",
                "commenter_name": "Anne Gallagher",
                "replies": []
            },
            {
                "comment": "A young girl my god disgusting human (not human if she thinks it's funny to Rob the Dr and kicking/\npunching) shame on you and other men too..\nJail them for life till they die!!!\nWhat the world coming to?",
                "commenter_name": "Yvonne Jones",
                "replies": []
            },
            {
                "comment": "What up bringing do these murdering scumbags have",
                "commenter_name": "Ruth Holmes",
                "replies": []
            },
            {
                "comment": "I just wish hanging was still used for cases were there is no doubt of guilt for such brutal and merciless crimes. 😠😠😠",
                "commenter_name": "Liz Wainwright",
                "replies": [
                    "Liz Wainwright everyone will die at some point, it’s all our destiny on this earth, so death is hardly a punishment. Pain, guilt and remorse stops when you die. You’ve got to be alive to experience any form of punishment."
                ]
            },
            {
                "comment": "Three half wits kill one person who’s given up years of his life to treat thousands of people (regardless of anything else in that title) We need a stronger punishment system",
                "commenter_name": "Debbie Walters",
                "replies": []
            },
            {
                "comment": "Simple solution to this - lock them up and give them no access to drs when they need one. Maybe then they’ll be remorseful of their actions 🤷🏼‍♀️",
                "commenter_name": "Kennedy Sian Power",
                "replies": []
            },
            {
                "comment": "Wtf is this world coming too 😞",
                "commenter_name": "Linzi Marsh",
                "replies": []
            },
            {
                "comment": "What do you expect from these low lives",
                "commenter_name": "Roux Le Rouxe",
                "replies": []
            },
            {
                "comment": "Why will a 17 years old decide to waste her life that way ? Why do people care so much about someone's personal life that gat nothing to do with them ?",
                "commenter_name": "Anderson Johno",
                "replies": []
            },
            {
                "comment": "They should never spend a day as a free person, lock the door and throw away the keys.",
                "commenter_name": "Christopher Wilde",
                "replies": []
            },
            {
                "comment": "So pathetic! RIP Dr😭😭💔💔",
                "commenter_name": "Kamukama Barbara",
                "replies": []
            },
            {
                "comment": "This is incredibly sad, how anyone could inflict such violence on such an innocent victim is beyond most peoples comprehension. These 'people's need to rot in jail until they die, which also should be where they will die",
                "commenter_name": "Joe Carne",
                "replies": []
            },
            {
                "comment": "Lock up all three for minimum of 50 years each ,no messing around the fact the victims sexuality was the primary motive, means these three monsters should die in prison, essentially a whole life tariff.",
                "commenter_name": "Ashok Dhami Bhardwaj",
                "replies": []
            },
            {
                "comment": "Rachel Docherty",
                "commenter_name": "Hannah Myzylowskyj",
                "replies": []
            },
            {
                "comment": "🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬🤬",
                "commenter_name": "Bindi J McKenzie",
                "replies": []
            },
            {
                "comment": "I hope they get the karmic justice they deserve when they meet the maker & rot in hell & die themselves a very cruel death. What pure evil humans these 3 are!",
                "commenter_name": "Nicola Magee",
                "replies": []
            },
            {
                "comment": "What is that? Can't you write an article that's more than four sentences long and provides sufficient information? It only says the trio tried to rob him and were egging each other on",
                "commenter_name": "David Benson",
                "replies": []
            },
            {
                "comment": "What's wrong with humans these days?",
                "commenter_name": "Mark Turnbull",
                "replies": [
                    "Mark Turnbull privileges - greed 🤷🏾‍♂️",
                    "Mark Turnbull nothing people have always been capable of brutality",
                    "Mark Turnbull they're not human. They're vile depraved beasts.",
                    "Mark Turnbull these days? Is gay bashing a new thing in your mind?",
                    "Mark Turnbull Better to have a dog. 😜"
                ]
            },
            {
                "comment": "Three idiots take a life because he won't fight back , so brave of them coward's.",
                "commenter_name": "Patrick Shevlin",
                "replies": []
            },
            {
                "comment": "How Horrific...\nThose 3 need putting down!!!",
                "commenter_name": "Delwara Faruk",
                "replies": []
            },
            {
                "comment": "Evil. How was this poor man affecting them in any way? What evil people.",
                "commenter_name": "Elaine Kettle",
                "replies": []
            },
            {
                "comment": "'They think it's funny, it was just enjoyment for them'. Chilling, but those words sum it up in a nutshell. Whatever excuse you make for their behaviour, there really is no hope for some people. If you can do that because you feel you 'need it' at the age of sixteen, then I'm not sure there's any possibility of redemption for you. As for the two men - both old enough to know the difference between right and wrong. Give all three a sentence that means something for once.After all, the one they've just given to Dr Jenkins's family will run for life without parole.",
                "commenter_name": "Rosemary Hill",
                "replies": []
            },
            {
                "comment": "Life should mean life, doubt the girl will get much but they should sterelise the little cnt anyway.",
                "commenter_name": "Steven Burke",
                "replies": []
            },
            {
                "comment": "Lethal injections required for all three !",
                "commenter_name": "Carol Harper",
                "replies": []
            },
            {
                "comment": "What a despicable act ! 😡",
                "commenter_name": "Geoff Wood",
                "replies": []
            },
            {
                "comment": "Omg 😳 what evil people 😡😢",
                "commenter_name": "Lindsy Ord",
                "replies": []
            },
            {
                "comment": "Lock them away for good throwaway the Key",
                "commenter_name": "Debra Fazio",
                "replies": []
            },
            {
                "comment": "These people need putting down.",
                "commenter_name": "John Semple",
                "replies": []
            },
            {
                "comment": "What vile monsters, they're definately not human! I really hope their sentences are long. They all deserve 30yrs at least. Little miss 17yr old doesn't need any mercy either because of her age, she enjoyed every minute taking that man's life from him!!",
                "commenter_name": "Barbara Jane Henderson",
                "replies": []
            },
            {
                "comment": "The eye-witness account is kind of weird. He just watched?",
                "commenter_name": "Camilla Johansson",
                "replies": [
                    "Camilla Johansson he tried to create a barrier but they turned on him",
                    "Ah!",
                    "Camilla Johansson no, it said he attempted to protect the man until they turned on him too. Right in the article.",
                    "Camilla Johansson did you actually read the article? Have another look 🤦‍♂️",
                    "Camilla Johansson No! Read the article.",
                    "Steve Cole Ok, I missed the last sentence. I'm not going to apologise for asking though. It's always better to ask one question too many than one too few.",
                    "Anne Gallagher How about you read the dialogue in response to my question.",
                    "How about you delete your comment?",
                    "Camilla Johansson would you of saved this man from 3 attackers?",
                    "Hughie Roberts Probably not, but I like to think that I wouldn't just have watched, which I know now that the witness didn't. Read the comments.",
                    "Anne Gallagher How about \"No\"?",
                    "Camilla Johansson How about you not looking for argument and being a bully? Where you are bully in school? I bet 10 to 1 that you were!!! Now go away like a good little girl.",
                    "Camilla Johansson how about you read the article. Oh you didn't, you skipped through and missed the important points about the eye witness.",
                    "Camilla Johansson they have also been charged with assault on the eye witness"
                ]
            },
            {
                "comment": "Wtf these people are wicked",
                "commenter_name": "Andrea Sacchetto",
                "replies": []
            },
            {
                "comment": "Cruel",
                "commenter_name": "Eartha Mokhatshane",
                "replies": []
            },
            {
                "comment": "Life",
                "commenter_name": "Cindy Coppola",
                "replies": []
            },
            {
                "comment": "Absolutely disgusting.",
                "commenter_name": "Kayleigh Sowerby",
                "replies": []
            },
            {
                "comment": "Horrific!!",
                "commenter_name": "Alyson Hope",
                "replies": []
            }
        ]
    }
]